<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>
<body>


<?php
//Задание 1
echo "<u>Задание 1</u><br>";
$a = 0;
while ($a <= 100)
{
    if ($a % 3 == 0)
    {
        echo $a . " ";
    }
    $a++;
}

//Задание 2
echo "<br><br><u>Задание 2 </u><br>";
$b = 0;
do
{
    if ($b == 0)
    {
        echo $b . " - ноль<br>";
    }
    elseif ($b % 2 == 0)
    {
        echo $b . " - четное число<br>";
    }
    elseif ($b % 2 > 0)
    {
        echo $b . " - нечетное число<br>";
    }
    $b++;
}
while ($b <= 10);

//Задание 3
echo "<br><u>Задание 3 </u>";
$districts = array(
    "Московская область" => array(
        "Москва",
        "Зеленоград",
        "Клин"
    ) ,
    "Тюменская область" => array(
        "Тюмень",
        "Тобольск",
        "Ишим",
        "Ялтуровск",
        "Уват",
        "Боровский"
    ) ,
    "Ленинградская область" => array(
        "Санкт-Петербург",
        "Всеволожск",
        "Павловск",
        "Кронштадт"
    ) ,
    "Рязанская область" => array(
        "Рязань",
        "Касимов",
        "Скопин",
        "Сасово",
        "Ряжск"
    )
);

foreach ($districts as $district => $region)
{
    echo "<br><br>$district: <br>";
    foreach ($region as $city)
    {
        echo "$city, ";
    }
}

//Задание 4
echo "<br><br><u>Задание 4 </u><br>";
function translate($string)
{
    $letters = array(
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "y",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "ts",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "sch",
        "ъ" => "",
        "ы" => "i",
        "ь" => "'",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya",
        "А" => "A",
        "Б" => "B",
        "В" => "V",
        "Г" => "G",
        "Д" => "D",
        "Е" => "E",
        "Ё" => "YO",
        "Ж" => "ZH",
        "З" => "Z",
        "И" => "I",
        "Й" => "Y",
        "К" => "K",
        "Л" => "L",
        "М" => "M",
        "Н" => "N",
        "О" => "O",
        "П" => "P",
        "Р" => "R",
        "С" => "S",
        "Т" => "T",
        "У" => "U",
        "Ф" => "F",
        "Х" => "H",
        "Ц" => "TS",
        "Ч" => "CH",
        "Ш" => "SH",
        "Щ" => "SCH",
        "Ъ" => "",
        "Ы" => "I",
        "Ь" => "'",
        "Э" => "E",
        "Ю" => "YU",
        "Я" => "YA"
    );
    return str_replace(array_keys($letters) , array_values($letters) , $string);
}
echo translate('оЧеНь СтРаНнЫй ТеКсТ');

//Задание 5
echo "<br><br><u>Задание 5 </u><br>";
function addUnderLine($string)
{
    $add = str_replace(" ", "_", $string);
    echo $add;
}
addUnderLine("Всем кто сейчас читает мой код - привет!");

//Задание 6
echo "<br><br><u>Задание 6 </u><br>";
$menu = array(
    "Новости о спорте",
    "Новости о политике",
    "Новости о мире",
    "Контакты",
    "Справка"
);
foreach ($menu as $item)
{
    $s = "<ul> <li> $item </li> </ul>";
    echo $s;
}

//Задание 7
echo "<br><br><u>Задание 7 </u><br>";
for ($i = 0;$i < 9;$i++, print ("$i "))
{
}

//Задание 8
echo "<br><br><u>Задание 8 </u><br>";
$newDistricts = array(
    "Московская область" => array(
        "Москва",
        "Зеленоград",
        "Клин"
    ) ,
    "Тюменская область" => array(
        "Тюмень",
        "Тобольск",
        "Ишим",
        "Ялтуровск",
        "Уват",
        "Боровский"
    ) ,
    "Ленинградская область" => array(
        "Санкт-Петербург",
        "Всеволожск",
        "Павловск",
        "Кронштадт"
    ) ,
    "Рязанская область" => array(
        "Рязань",
        "Касимов",
        "Скопин",
        "Сасово",
        "Ряжск"
    )
);

foreach ($newDistricts as $newDistrict => $newRegion)
{
    foreach ($newRegion as $newCity)
    {
        if (mb_substr($newCity, 0, 1) === "К") echo $newCity . "<br/>";
    }
}

//Задание 9
echo "<br><u>Задание 9 </u><br>";
function newTranslate($string)
{
    $letters = array(
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "y",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "ts",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "sch",
        "ъ" => "",
        "ы" => "i",
        "ь" => "'",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya",
        "А" => "A",
        "Б" => "B",
        "В" => "V",
        "Г" => "G",
        "Д" => "D",
        "Е" => "E",
        "Ё" => "YO",
        "Ж" => "ZH",
        "З" => "Z",
        "И" => "I",
        "Й" => "Y",
        "К" => "K",
        "Л" => "L",
        "М" => "M",
        "Н" => "N",
        "О" => "O",
        "П" => "P",
        "Р" => "R",
        "С" => "S",
        "Т" => "T",
        "У" => "U",
        "Ф" => "F",
        "Х" => "H",
        "Ц" => "TS",
        "Ч" => "CH",
        "Ш" => "SH",
        "Щ" => "SCH",
        "Ъ" => "",
        "Ы" => "I",
        "Ь" => "'",
        "Э" => "E",
        "Ю" => "YU",
        "Я" => "YA"
    );
    $string = str_replace(" ", "_", $string);
    echo str_replace(array_keys($letters) , array_values($letters) , $string);
}
newTranslate("Последнее задание выполнено успешно");

?>
    
</body>
</html>
